In [1]:
import numpy as np
import pandas as pd
df = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
                  'key2':['one', 'two', 'one', 'two', 'one'],
                  'data1': np.random.randn(5),
                  'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one -0.738962 -0.441203
1    a  two -1.680433 -0.144071
2    b  one  0.770785 -0.073775
3    b  two -0.427515 -0.596641
4    a  one  0.199539 -1.039488

In [5]:
#利用階層式索引建立群組
df1=df.set_index(['key1', 'key2'])
df1

              data1     data2
key1 key2
a    one  -0.738962 -0.441203
     two  -1.680433 -0.144071
b    one   0.770785 -0.073775
     two  -0.427515 -0.596641
a    one   0.199539 -1.039488

In [8]:
df1.sum(level=['key1','key2'])

              data1     data2
key1 key2
a    one  -0.539423 -1.480691
     two  -1.680433 -0.144071
b    one   0.770785 -0.073775
     two  -0.427515 -0.596641